package pokemonPrjct.pokemon.gameengine;

public enum Type {
    NORMAL,
    FIRE,
    WATER,
    ELECTRIC,
    GRASS,
    ICE,
    FIGHTING,
    POISON,
    GROUND,
    FLYING,
    PSYCHIC,
    BUG,
    ROCK,
    GHOST,
    DRAGON,
    DARK,
    STEEL,
    FAIRY
}

//    Кодът дефинира enum, наречен "Type", който изброява различните типове Pokemon в играта.
//    Това е добър начин за представяне на краен набор от стойности по безопасен за типа начин, където
//    всяка постоянна стойност има име и фиксирана стойност. В този случай всяка константа представлява
//    тип покемон и е представена от низ. Използването на enum по този начин прави кода по-четлив и помага
//    за избягване на потенциални грешки, дължащи се на грешни или неправилни низове.